/* No comment provided by engineer. */
"%1.0lf seconds" = "%1.0lf sekuntia";

/* No comment provided by engineer. */
"%i days" = "%i päivää";

/* No comment provided by engineer. */
"%i hours" = "%i tuntia";

/* No comment provided by engineer. */
"%i minutes" = "%i minuuttia";

/* No comment provided by engineer. */
"%i weeks" = "%i viikkoa";

/* No comment provided by engineer. */
"1 day" = "1 päivä";

/* No comment provided by engineer. */
"1 hour" = "1 tunti";

/* No comment provided by engineer. */
"1 minute" = "1 minuutti";

/* No comment provided by engineer. */
"1 second" = "1 sekunti";

/* No comment provided by engineer. */
"1 week" = "1 viikko";

/* No comment provided by engineer. */
"<<Attachment>>" = "<<Liite>>";

/* No comment provided by engineer. */
"Add" = "Lisää";

/* clear all marks contextual menu item title */
"Clear All Marks" = "Poista kaikki merkit";

/* clear marks from here up contextual menu */
"Clear Marks from Here Down" = "Poista kaikki merkit tästä alaspäin";

/* clear marks from here left contextual menu */
"Clear Marks from Here Left" = "Poista kaikki merkit tästä vasemmalle";

/* clear marks from here right contextual menu */
"Clear Marks from Here Right" = "Poista kaikki merkit tästä oikealle";

/* clear marks from here up contextual menu */
"Clear Marks from Here Up" = "Poista kaikki merkit tästä ylöspäin";

/* Copy the link to the clipboard */
"Copy Link" = "Kopioi linkki";

/* No comment provided by engineer. */
"Delete" = "Poista";

/* No comment provided by engineer. */
"Image Picker" = "Kuvanpoimija";

/* No comment provided by engineer. */
"Invalid Input" = "Virheellinen syöttö";

/* jump to the mark where the last content the user saw ends */
"Jump to Focus Mark" = "Siirry kohdistusmerkkiin";

/* jump to next mark contextual menu */
"Jump to Next Mark" = "Siirry seuraavaan merkkiin";

/* jump to previous mark contextual menu */
"Jump to Previous Mark" = "Siirry edelliseen merkkiin";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Picture" = "Kuva";

/* No comment provided by engineer. */
"Select Image" = "Valitse kuva";